УТ_для_edt/src/Documents/смартПредзаказПоставщику/смартПредзаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартПредзаказПоставщику</name>
  <comment>#1637 смарт Ермаков 14.02.2024 / Рефакторинг объектов &quot;Предзаказ поставщику&quot;</comment>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <registerRecords>AccumulationRegister.смартПредзаказыПоставщикам</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склады</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрогнозГотовностиУПоставщика</name>
    <comment>#Б-3262 смарт: Лопато 14.05.2025 //Доработать отчет &quot;Остатки и доступность товаров&quot;. Добавить информацию о прогнозном сроке изготовления.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <type>
        <types>CatalogRef.ВидыЦенПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <comment>#4552 смарт: Тимофеева 01.10.2025 / Автозаказ. Формирование предзаказов по потребностям.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышенныйТаможенныйСбор</name>
      <comment>#6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураПартнера</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦеныПоставщика</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСоглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/смартПредзаказыПоставщикам/смартПредзаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартПредзаказыПоставщикам</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПоДаннымПоставщикаУдалить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщикаУдалить</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредзаказПоставщику</name>
    <type>
      <types>DocumentRef.смартПредзаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/ВидыЦенПоставщиков/ВидыЦенПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦенПоставщиков</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноДляЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноДляПродажиКлиентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартПредзаказПоставщику/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийИЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор=Пользователи.ТекущийПользователь();
		Объект.Менеджер=Объект.Автор;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Импорт=Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
			И Не Объект.Валюта=Константы.ВалютаРегламентированногоУчета.Получить()
			И Не Объект.ЦенаВключаетНДС ;
			
	//++ смарт:КМД #3_2 179 28.12.2020
	//добавлена кнопка и команда заполнения цен поставщиков и другие элементы формы программно
	смарт_ДобавитьЭлементыФормы();
	//-- смарт:КМД #3_2 179 28.12.2020
	
	//++ смарт:КМД #3_3 423 28.12.2020
	смарт_ИзменитьФормуДокументОснование();
	ЭтотОбъект.ПредзаказПоЗаказу = ЗначениеЗаполнено(Объект.ДокументОснование);
	//-- смарт:КМД #3_3 423 28.12.2020
	
	//++ #Б2434 смарт: Шляпников 04.03.2025 / Заявка на гарантийный ремонт. Дополнительные статусы.
	// Обработчик механизма "Назначения"
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);
	//-- #Б2434 смарт: Шляпников 04.03.2025
	
	//++ #Б2710 смарт: Шляпников 18.03.2025 / Заявка на разборку оборудования. Обработка Подбор товара.
	Элементы.Переместить(Элементы.ТоварыПодборДанныхПоПотребностямЗаявокНаРазборку, Элементы.ГруппаТоварыЗаполнить);
	//-- #Б2710 смарт: Шляпников 18.03.2025
	
	//++ #Б6770 смарт: Шляпников 04.05.2026 / Маркировка. Документ Предзаказ поставщику. Добавит пиктограммы ЧЗ.
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма);
	//-- #Б6770 смарт: Шляпников 04.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЕстьНДС=Не Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС");
	Элементы.ЦенаВключаетНДС.Доступность=ЕстьНДС;
	Элементы.ГруппаСтраницыВсего.ТекущаяСтраница=?(ЕстьНДС,Элементы.СтраницаВсегоСНДС,Элементы.СтраницаВсегоБезНДС);
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	ЕстьНДС=Не Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС");
	Объект.ЦенаВключаетНДС=?(ЕстьНДС,Объект.ЦенаВключаетНДС,Ложь);
	Элементы.ЦенаВключаетНДС.Доступность=ЕстьНДС;
	Элементы.ГруппаСтраницыВсего.ТекущаяСтраница=?(ЕстьНДС,Элементы.СтраницаВсегоСНДС,Элементы.СтраницаВсегоБезНДС);
	Элементы.ТоварыСуммаСНДС.Заголовок=?(ЕстьНДС,"Сумма с НДС","Сумма всего");
	
	ПересчитатьТабличнуюЧастьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	ПересчитатьТабличнуюЧастьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПриИзменении(Элемент)
	Если Импорт Тогда 
		Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС");
		Объект.ЦенаВключаетНДС=Ложь;
		Объект.Валюта=ПолучитьВалютуУправленческогоУчета();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.смартПредзаказПоставщику.смарт_ФормаДокумента.Команда.ПодобратьТовары");
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта документа не заполнена",,"Объект.Валюта",,Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",        Объект.Ссылка);
	ПараметрыФормы.Вставить("Партнер",         Объект.Партнер);
	ПараметрыФормы.Вставить("Склад",      	   Объект.Склады);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("Валюта",          Объект.Валюта);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);

	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки", Истина);
		
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументЗакупки.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументЗакупки.Форма.Форма" Тогда
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КэшированныеЗначения=Объект.Валюта;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Если Не Объект.Валюта=КэшированныеЗначения И ЗначениеЗаполнено(КэшированныеЗначения) Тогда 
		ПересчитатьТоварыИзВалютыВВалюту(КэшированныеЗначения,Объект.Валюта);
		Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
	КонецЕсли;
	КэшированныеЗначения=Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//++ #Б6948 смарт: Шляпников 11.06.2026 / Маркировка. Алгоритм действий системы и БП при заказе нового товара при наличии остатков на складах.
	смартМаркировкаКлиент.ВывестиСообщениеОБудущейМаркировкеНоменклатурыПоДокументу(Объект);
	//-- #Б6948 смарт: Шляпников 11.06.2026
	
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПересчитатьСумму(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если Элемент.Имя="ТоварыСуммаРучнойСкидки" Тогда 
		ТекущаяСтрока.ПроцентРучнойСкидки=ТекущаяСтрока.СуммаРучнойСкидки/(ТекущаяСтрока.КоличествоУпаковок*ТекущаяСтрока.Цена)*100;
	КонецЕсли;	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)

	//++#1894 смарт: Лопато 09.07.2024 //Процент выполнения предзаказа
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	ТоварыПересчитатьСумму(Элемент);
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		
		ВыполнитьКонтрольКоличестваПоСтроке(ТекущаяСтрока);
	
	КонецЕсли;
	//--#1894 смарт: Лопато 09.07.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Стр = Элементы.Товары.ТекущиеДанные;
	
	//++ #3942 смарт: Шляпников 01.08.2025 / Запрет выбора в документах закупки (Предзаказ, Заказ поставщика) номенклатуры из папки Архив (только запчасти!)
	Если НЕ смартСервер.ПроверитьДоступностьИспользованияНоменклатурыВДокументеЗакупки(стр.Номенклатура) Тогда
		стр.Номенклатура = Неопределено;
	КонецЕсли;
	//-- #3942 смарт: Шляпников 01.08.2025
	
	Стр.Цена = ПолучитьЦенуНоменклатурыПоставщика(ПолучитьОтборДляЦеныПоставщика(Стр));
	ТоварыПересчитатьСумму(Элемент);
	
	//++ #1388 смарт: Фролов 13.07.2023 //Доработка печатной формы предзаказа  
	//ЗаполнитьНоменклатуруПоставщикаПоНашейНоменклатуре(Стр.ПолучитьИдентификатор());
	УстановитьИспользоватьХарактеристику(Стр.ПолучитьИдентификатор());
	Стр.НоменклатураПартнера = ПолучитьНоменклатуруПоставщика(Стр.Номенклатура,Стр.НомерСтроки); 
	//-- #1388 смарт: Фролов 13.07.2023
	
	//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
	ЗаполнитьЗначенияСвойств(Стр, ПолучитьЗначенияПошлиныИТаможенногоСбора(Стр.Номенклатура));
    //-- #6726  смарт: Тимофеева 22.05.2026
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаПриИзменении(Элемент)
	Стр=Элементы.Товары.ТекущиеДанные;
	ЗаполнитьНоменклатуруПоДаннымПоставщика(Стр.ПолучитьИдентификатор());
	Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда			
		ТоварыНоменклатураПриИзменении(Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидЦеныПоставщикаПриИзменении(Элемент)
	Стр=Элементы.Товары.ТекущиеДанные;
	Стр.Цена=ПолучитьЦенуНоменклатурыПоставщика(ПолучитьОтборДляЦеныПоставщика(Стр));
	ТоварыПересчитатьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТоварыПересчитатьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогТоваров(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Если Не Объект.Ссылка.Пустая() Тогда 
		Отказ=Не ЕстьВозможностьИзменитьСтроку(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		КэшированныеЗначения=Элементы.Товары.ТекущиеДанные;
		Если Не ЕстьВозможностьИзменитьСтроку(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор()) Тогда
			СтандартнаяОбработка=Ложь;
			ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные,КэшированныеЗначения);
		КонецЕсли;
		КэшированныеЗначения=Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		КэшированныеЗначения=Элементы.Товары.ТекущиеДанные;
		Если Не ЕстьВозможностьИзменитьСтроку(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор()) Тогда
			СтандартнаяОбработка=Ложь;
			ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные,КэшированныеЗначения);			
		КонецЕсли;
		КэшированныеЗначения=Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	//++ #3974 смарт: Тимофеева 06.08.2025 / Создание Заказа поставщика из Предзаказа, задвоение количества
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСумму(Элемент); 
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		
		ВыполнитьКонтрольКоличестваПоСтроке(ТекущаяСтрока);
	
	КонецЕсли;
	//-- #3974 смарт: Тимофеева 06.08.2025
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОтчетПоПредзаказу(Команда)
	ПараметрыОтчета=Новый Структура("Отбор,КлючНазначенияИспользования,КлючВарианта,СформироватьПриОткрытии",
					Новый Структура("ПредзаказПоставщику",Объект.Ссылка),
					,"Основной",Истина);
	
	ОткрытьФорму("Отчет.смартОтчетПоПредзаказам.Форма",ПараметрыОтчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымДокумента(Команда)
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните валюту документа",,"Объект.Валюта");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите тип налогообладения документа",,"Объект.НалогообложениеНДС");
		Возврат;
	КонецЕсли;

	Список=Новый СписокЗначений;
	Список.Добавить("ЗаказПоставщику");
	Список.Добавить("ПриобретениеТоваровУслуг");

	Оп=Новый ОписаниеОповещения("ПослеВыбораТипаДокумента",ЭтотОбъект);
	ПоказатьВыборИзСписка(Оп,Список);
КонецПроцедуры

//++ #Б2710 смарт: Шляпников 18.03.2025 / Заявка на разборку оборудования. Обработка Подбор товара.
&НаКлиенте
Процедура ПодборДанныхПоПотребностямЗаявокНаРазборку(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Склад", Объект.Склады);
	ПараметрыПодбора.Вставить("Предзаказ", Объект.Ссылка);
	ПараметрыПодбора.Вставить("ДанныеДокумента", ПолучитьТоварыДокументаДляДальнейшегоПодбора());
	
	ОткрытьФорму("Документ.смартПредзаказПоставщику.Форма.ФормаПодбораПоЗаявкаНаРазборкуОборудования", 
				 ПараметрыПодбора,
				 ЭтаФорма,,,,
				 Новый ОписаниеОповещения("ПодборДанныхПоПотребностямЗаявокНаРазборкуЗавершение", ЭтаФорма));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
		
	// Условное офрмление характеристик номенклатуры
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ИспользоватьХарактеристику");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаРучнойСкидки.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПроцентРучнойСкидки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПроцентРучнойСкидки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);
	//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПовышенныйТаможенныйСбор.Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПовышенныйТаможенныйСбор.Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	//-- #6726  смарт: Тимофеева 22.05.2026
	
	//++ #Б7206 смарт: Шляпников 30.06.2026 / Реквизит Повышенный таможенный сбор в документах Предзаказ поставщику и Заказ поставщику. Доработка.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПовышенныйТаможенныйСбор.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
	
	////////////////////////////////////////////////////
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПовышенныйТаможенныйСбор.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПовышенныйТаможенныйСбор");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	//-- #Б7206 смарт: Шляпников 30.06.2026
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьОтборДляЦеныПоставщика(Стр)
	Отбор=Новый Структура("Партнер,Номенклатура",Объект.Партнер,Стр.Номенклатура);
	Если ЗначениеЗаполнено(Стр.Характеристика) Тогда 
		Отбор.Вставить("Характеристика",Стр.Характеристика);
	КонецЕсли;
	Если ЗначениеЗаполнено(Стр.ВидЦеныПоставщика) Тогда 
		Отбор.Вставить("ВидЦеныПоставщика",Стр.ВидЦеныПоставщика);
	КонецЕсли;
	Возврат Отбор;
КонецФункции	

&НаКлиенте
Процедура ПересчитатьТабличнуюЧастьТовары()
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
	Для Каждого Стр Из Объект.Товары Цикл 
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, КэшированныеЗначения);
	КонецЦикла;
	Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма)	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("ПересчитыватьСуммуРучнойСкидки", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
КонецПроцедуры

&НаСервере
//++ #1388 смарт: Фролов 13.07.2023 //Доработка печатной формы предзаказа 
//Процедура ЗаполнитьНоменклатуруПоставщикаПоНашейНоменклатуре(ИДСтроки)
Процедура УстановитьИспользоватьХарактеристику(ИДСтроки) 
//-- #1388 смарт: Фролов 13.07.2023
	Стр=Объект.Товары.НайтиПоИдентификатору(ИДСтроки);  
	Стр.ИспользоватьХарактеристику=Не Стр.Номенклатура.ИспользованиеХарактеристик=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНоменклатуруПоДаннымПоставщика(ИДСтроки)
	Стр=Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	Стр.Номенклатура=Стр.НоменклатураПартнера.Номенклатура; 
	Стр.ИспользоватьХарактеристику=Не Стр.Номенклатура.ИспользованиеХарактеристик=ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыПоставщика(Отбор)
	Возврат РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПолучитьПоследнее(,Отбор).Цена;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьВалютуУправленческогоУчета()
	Возврат Константы.ВалютаУправленческогоУчета.Получить();
КонецФункции	

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		//++ #3942 смарт: Шляпников 01.08.2025 / Запрет выбора в документах закупки (Предзаказ, Заказ поставщика) номенклатуры из папки Архив (только запчасти!)
		Если НЕ смартСервер.ПроверитьДоступностьИспользованияНоменклатурыВДокументеЗакупки(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		//-- #3942 смарт: Шляпников 01.08.2025
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "НоменклатураПартнера, Номенклатура, Характеристика, Упаковка, ВидЦеныПоставщика, Цена, КоличествоУпаковок");
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
		
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПолучитьЗначенияПошлиныИТаможенногоСбора(ТекущаяСтрока.Номенклатура));
		//-- #6726  смарт: Тимофеева 22.05.2026
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЕстьВозможностьИзменитьСтроку(ИДСтроки)
	Стр=Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ПредзаказПоставщику",Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Стр.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Стр.Характеристика);
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	смартПредзаказыПоставщикам.Регистратор КАК Регистратор
	             |ИЗ
	             |	РегистрНакопления.смартПредзаказыПоставщикам КАК смартПредзаказыПоставщикам
	             |ГДЕ
	             |	смартПредзаказыПоставщикам.ПредзаказПоставщику = &ПредзаказПоставщику
	             |	И НЕ смартПредзаказыПоставщикам.Регистратор = &ПредзаказПоставщику
	             |	И смартПредзаказыПоставщикам.Номенклатура = &Номенклатура
	             |	И смартПредзаказыПоставщикам.Характеристика = &Характеристика";
	МассивДокументов=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	Если МассивДокументов.Количество() Тогда 
		ТекстОшибки="По данной строке есть заказы поставщикам. Изменения не могут быть внесены.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции	

&НаСервере
Функция ВозможноеИзменениеКоличества(ИДСтроки,Кол)
	КоличествоДляИзменения=Кол;
	
	Стр=Объект.Товары.НайтиПоИдентификатору(ИДСтроки);
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ПредзаказПоставщику",Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Стр.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Стр.Характеристика);
	Запрос.УстановитьПараметр("Кол",Кол);
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	Т.ЗаказаноПриход КАК СтароеКоличество,
	             |	ЕСТЬNULL(Т.ЗаказаноРасход, 0) КАК ВЗаказах,
	             |	ЕСТЬNULL(Т.ЗаказаноКонечныйОстаток, 0) >= ЕСТЬNULL(Т.ЗаказаноПриход, 0) - &Кол КАК Можно
	             |ИЗ
	             |	РегистрНакопления.смартПредзаказыПоставщикам.ОстаткиИОбороты(
	             |			,
	             |			,
	             |			,
	             |			,
	             |			ПредзаказПоставщику = &ПредзаказПоставщику
	             |				И Номенклатура = &Номенклатура
	             |				И Характеристика = &Характеристика) КАК Т";
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() И Не Рез.Можно Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В подчиенных заказах поставщикам уже заказно "+Рез.ВЗаказах);
		КоличествоДляИзменения=Рез.СтароеКоличество;
	КонецЕсли;
	Возврат КоличествоДляИзменения;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораТипаДокумента(ВыбранноеЗначение,ДопПараметры)Экспорт 
	Если Не ВыбранноеЗначение=Неопределено Тогда
		ОП=Новый ОписаниеОповещения("ПослеВыбораДокументаДляЗаполнения",ЭтотОбъект);
		ОткрытьФорму("Документ."+ВыбранноеЗначение.Значение+".ФормаВыбора",,ЭтаФорма,,,,ОП,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораДокументаДляЗаполнения(РезультатВыбора,ДопПараметры)Экспорт 
	Если Не РезультатВыбора=Неопределено Тогда 
		ЗаполнитьПоДаннымВыбранногоДокумента(РезультатВыбора);
		Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоДаннымВыбранногоДокумента(Документ)
	Импорт=Объект.НалогообложениеНДС=ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
			И Не Объект.Валюта=Константы.ВалютаРегламентированногоУчета.Получить()
			И Не Объект.ЦенаВключаетНДС;
	ПересчитатьВалюту=Ложь;		
	Если Не Объект.Валюта=Документ.Валюта Тогда
		СтруктураКурсовСтаройВалюты=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Документ.Валюта, Объект.Дата);
		СтруктураКурсовНовойВалюты=РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта,  Объект.Дата);
		ПересчитатьВалюту=Истина;
	КонецЕсли;
	
	МассивПустыхСтрок=Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")));
	Для Каждого Стр Из МассивПустыхСтрок Цикл 
		Объект.Товары.Удалить(Стр);
	КонецЦикла;	
	
	Для Каждого Стр Из Документ.Товары Цикл
		НовСтр=Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр,"Номенклатура,Характеристика,Упаковка,КоличествоУпаковок,Количество,Цена");
		Если ПересчитатьВалюту Тогда 
			НовСтр.Цена=РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НовСтр.Цена,СтруктураКурсовСтаройВалюты,СтруктураКурсовНовойВалюты);
		КонецЕсли;	
	КонецЦикла;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары,СтруктураДействий, Неопределено);
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	
КонецПроцедуры	

&НаСервере
Процедура ПересчитатьТоварыИзВалютыВВалюту(СтараяВалюта,НоваяВалюта)
	СтруктураКурсовСтаройВалюты=РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтараяВалюта, Объект.Дата);
	СтруктураКурсовНовойВалюты=РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяВалюта,  Объект.Дата);
	
	Ценообразование.ПересчитатьСуммыТабличнойЧастиВВалюту(
			Объект.Товары,
			Объект.ЦенаВключаетНДС,
			СтараяВалюта,
			НоваяВалюта,
			СтруктураКурсовСтаройВалюты,
			СтруктураКурсовНовойВалюты,
			Ложь,
			Истина);		
КонецПроцедуры	

//++ смарт:КМД #3_2 179 28.12.2020
&НаСервере
Процедура смарт_ДобавитьЭлементыФормы()
	НовКоманда = ЭтаФорма.Команды.Добавить("ЗаполнитьЦеныПоставщиковКоманда");
    НовКоманда.Действие = "смарт_ЗаполнитьЦеныПоставщиков";
	
	НовКнопка = ЭтаФорма.Элементы.Добавить("ЗаполнитьЦеныПоставщиков", Тип("КнопкаФормы"), Элементы.ГруппаТоварыЗаполнить);
	НовКнопка.Заголовок = "Заполнить виды цен поставщиков";
	НовКнопка.ИмяКоманды = "ЗаполнитьЦеныПоставщиковКоманда";

КонецПроцедуры

//++#1894 смарт: Лопато 09.07.2024 //Процент выполнения предзаказа
&НаКлиенте
Процедура ВыполнитьКонтрольКоличестваПоСтроке(ТекущаяСтрока)

	ВозможноеИзмКол = ВозможноеИзменениеКоличества(ТекущаяСтрока.ПолучитьИдентификатор(), ТекущаяСтрока.Количество);
	
	Если ТекущаяСтрока.Количество <> ВозможноеИзмКол Тогда
		
		ТекущаяСтрока.Количество = ВозможноеИзмКол;
		
		СтруктураДействий = Новый Структура;
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("ПересчитыватьСуммуРучнойСкидки", Ложь));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

		Объект.СуммаДокумента = Объект.Товары.Итог("СуммаСНДС");
		
	КонецЕсли;

КонецПроцедуры //--#1894 смарт: Лопато 09.07.2024	

//++ #Б2710 смарт: Шляпников 18.03.2025 / Заявка на разборку оборудования. Обработка Подбор товара.
&НаКлиенте
Процедура ПодборДанныхПоПотребностямЗаявокНаРазборкуЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено И ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Для каждого стрЗначение Из Значение Цикл
			
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗначение);
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			
			Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			ТоварыНоменклатураПриИзменении(Элементы.Товары);
			
		КонецЦикла;
		
		//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
		ЗаполнитьДанныеОМаркировкеНоменклатуры();
		//-- #Б6794 смарт: Шляпников 07.05.2026
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б2710 смарт: Шляпников 18.03.2025 / Заявка на разборку оборудования. Обработка Подбор товара.
&НаСервере
Функция ПолучитьТоварыДокументаДляДальнейшегоПодбора()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Товары.Выгрузить(, "Номенклатура,Характеристика,Назначение,Количество"));
	
КонецФункции

#КонецОбласти

#Область ЗаполнитьЦеныПоставщиков

//++ смарт:КМД #3_2 179 28.12.2020
&НаКлиенте
Процедура смарт_ЗаполнитьЦеныПоставщиков(Команда)
	
	ЗаполненыЦеныПоставщиков = Ложь;
	Для каждого стр из Объект.Товары цикл
		Если ЗначениеЗаполнено(стр.ВидЦеныПоставщика) тогда
			ЗаполненыЦеныПоставщиков = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаполненыЦеныПоставщиков = Истина тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ЗаполнитьЦеныПоставщиковЗавершение", ЭтаФорма), "Перезаполнить виды цен поставщиков?", РежимДиалогаВопрос.ДаНет);
	Иначе
		смарт_ЗаполнитьЦеныПоставщиковНаКлиенте();
	КонецЕсли;
   	
КонецПроцедуры

//++ смарт:КМД #3_2 179 28.12.2020
&НаКлиенте
Процедура смарт_ЗаполнитьЦеныПоставщиковЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		смарт_ЗаполнитьЦеныПоставщиковНаКлиенте();
	КонецЕсли;

КонецПроцедуры

//++ смарт:КМД #3_2 179 28.12.2020
&НаКлиенте
Процедура смарт_ЗаполнитьЦеныПоставщиковНаКлиенте()
	П = Новый Структура;
	П.Вставить("ЗакрыватьПриВыборе", Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Валюта", Объект.Валюта);
	Отбор.Вставить("Владелец", Объект.Партнер);
	
	П.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ВидыЦенПоставщиков.ФормаВыбора", П, ЭтаФорма, ЭтаФорма,,, Новый ОписаниеОповещения("смарт_ЗаполнитьЦеныПоставщиковНаКлиентеЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   	
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьЦеныПоставщиковНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) тогда
		Для каждого стр из Объект.Товары цикл
            стр.ВидЦеныПоставщика = Результат;
            стр.Цена = ПолучитьЦенуНоменклатурыПоставщика(ПолучитьОтборДляЦеныПоставщика(стр));
            //Смарт {[-](фрагмент УДАЛЕН)Подкин Алексей Иванович 17.11.2021 13:57:29 - задача 710
            //ТоварыПересчитатьСумму(Элементы.ТоварыВидЦеныПоставщика);
            //Смарт }Подкин Алексей Иванович 17.11.2021 13:57:29
            
            //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 17.11.2021 13:57:35 - задача 710
            СтруктураДействий = Новый Структура;
            СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
            ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
            
            ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(стр, СтруктураДействий, КэшированныеЗначения);
            Объект.СуммаДокумента=Объект.Товары.Итог("СуммаСНДС");
            //Смарт }Подкин Алексей Иванович 17.11.2021 13:57:35
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДокументОснование

//++ смарт:КМД #3_3 423 28.12.2020
&НаСервере
Процедура смарт_ИзменитьФормуДокументОснование()
	//отключение документа основания
	Реквизит_ПредзаказПоЗаказу = Новый РеквизитФормы("ПредзаказПоЗаказу", Новый ОписаниеТипов("Булево"),, "Предзаказ по заказу");
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Реквизит_ПредзаказПоЗаказу);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовЭлемент = Элементы.Вставить("ПредзаказПоЗаказу", Тип("ПолеФормы"), Элементы.ГруппаОснование, Элементы.ДокументОснование);
	НовЭлемент.ПутьКДанным = "ПредзаказПоЗаказу";
	НовЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовЭлемент.УстановитьДействие("ПриИзменении", "ПредзаказПоЗаказуПриИзменении");
	
	Элементы.ДокументОснование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
КонецПроцедуры

//++ смарт:КМД #3_3 423 28.12.2020
&НаКлиенте
Процедура ПредзаказПоЗаказуПриИзменении(Элемент)

	Если ЭтотОбъект.ПредзаказПоЗаказу = Ложь тогда
		Объект.ДокументОснование = ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка");
		Модифицированность = Истина;
	Иначе
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Валюта",                     Объект.Валюта);
		//ПараметрыОтбора.Вставить("Контрагент",                 Объект.Контрагент);
		//ПараметрыОтбора.Вставить("Договор",                    Объект.Договор);
		//ПараметрыОтбора.Вставить("НалогообложениеНДС",         Объект.НалогообложениеНДС);
		Если ЗначениеЗаполнено(Объект.Организация) тогда
			ПараметрыОтбора.Вставить("Организация",                Объект.Организация);
		КонецЕсли;
		//ПараметрыОтбора.Вставить("Партнер",                    Объект.Партнер);
		//ПараметрыОтбора.Вставить("Сделка",                     Объект.Сделка);
		//ПараметрыОтбора.Вставить("Соглашение",                 Объект.Соглашение);
		//ПараметрыОтбора.Вставить("ЦенаВключаетНДС",            Объект.ЦенаВключаетНДС);
		//ПараметрыОтбора.Вставить("ПорядокРасчетов",            Объект.ПорядокРасчетов);
		//ПараметрыОтбора.Вставить("ХозяйственнаяОперация",      Объект.ХозяйственнаяОперация);
		//ПараметрыОтбора.Вставить("ВернутьМногооборотнуюТару",  Объект.ВернутьМногооборотнуюТару);
		//ПараметрыОтбора.Вставить("НаправлениеДеятельности",    Объект.НаправлениеДеятельности);
		//ПараметрыОтбора.Вставить("ВернутьМногооборотнуюТару",  Объект.ВернутьМногооборотнуюТару);
		//ПараметрыОтбора.Вставить("ТребуетсяЗалогЗаТару",       Объект.ТребуетсяЗалогЗаТару);
		
		ОткрытьФорму(
			"Документ.ЗаказКлиента.ФормаВыбора",
			Новый Структура("Отбор", ПараметрыОтбора),,,,, Новый ОписаниеОповещения("ПредзаказПоЗаказуПриИзмененииПослеВыбора", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
            
КонецПроцедуры

//++ смарт:КМД #3_3 423 28.12.2020
&НаКлиенте
Процедура ПредзаказПоЗаказуПриИзмененииПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
    
	Если ЗначениеЗаполнено(Результат) тогда
		Объект.ДокументОснование = Результат;
		Модифицированность = Истина;
	Иначе
		ЭтотОбъект.ПредзаказПоЗаказу = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//++ #1388 смарт: Фролов 13.07.2023 //Доработка печатной формы предзаказа
&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоставщика(Команда)
	НомПП=1;
	Для Каждого Стр Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Стр.НоменклатураПартнера) Тогда
			Стр.НоменклатураПартнера=ПолучитьНоменклатуруПоставщика(Стр.Номенклатура,НомПП);
		КонецЕсли;
		НомПП=НомПП+1;                                           
	КонецЦикла;
КонецПроцедуры //-- #1388 смарт: Фролов 13.07.2023

//++ #1388 смарт: Фролов 13.07.2023 //Доработка печатной формы предзаказа  
&НаСервере
Функция ПолучитьНоменклатуруПоставщика(Номенклатура,НомПП)
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураКонтрагентов.Ссылка КАК НоменклатураПартнера
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.Владелец = &Владелец
		|	И НоменклатураКонтрагентов.Номенклатура = &Номенклатура
		|");
	Запрос.Параметры.Вставить("Владелец", Объект.Партнер);
	Запрос.Параметры.Вставить("Номенклатура", Номенклатура); 
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=1 Тогда
		Если Выборка.Следующий() Тогда
			Возврат Выборка.НоменклатураПартнера;
		КонецЕсли;
	ИначеЕсли Выборка.Количество()=0 Тогда	
		Сообщить("Для номенклатуры "+Номенклатура+" в строке "+НомПП+" на найдена номенклатура поставщика");
		Возврат Неопределено;
	Иначе	
		Сообщить("Для номенклатуры "+Номенклатура+" в строке "+НомПП+" найдено более одной номенклатуры поставщика, выберите вручную");
		Возврат Неопределено;
	КонецЕсли;                                               
КонецФункции //-- #1388 смарт: Фролов 13.07.2023

//++ #6726  смарт: Тимофеева 22.05.2026 / Предзаказ поставщику. Доработка документа. Новые реквизиты Пошлина и Таможенный сбор.
&НаСервереБезКонтекста
Функция ПолучитьЗначенияПошлиныИТаможенногоСбора(Номенклатура)
	Результат = Новый Структура("СтавкаПошлины,ПовышенныйТаможенныйСбор", "", Ложь);
	
	КодТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КодТНВЭД");
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда
		ЗначенияРеквизитов 					= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодТНВЭД, "смартБазоваяСтавка,смартПовышенныйТаможенныйСбор");
		Результат.СтавкаПошлины 			= ЗначенияРеквизитов.смартБазоваяСтавка;
		Результат.ПовышенныйТаможенныйСбор 	= ЗначенияРеквизитов.смартПовышенныйТаможенныйСбор;
	КонецЕсли;
	Возврат Результат;
КонецФункции
//-- #6726  смарт: Тимофеева 22.05.2026
#КонецОбласти
